Week_6/Day_1/video-games-tournament/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def jsonindex
    @tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hello"], ["created_at", "2016-07-18 18:34:12.325734"], ["updated_at", "2016-07-18 18:34:12.325734"]]
---
  def new
    @new = Tournament.create(name: params[:tournament][:name])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]
---
  def destroy
    item = Tournament.find(params[:id])
    item.destroy